---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateRevealIntegral
source: html/aeb437ba-8f39-fe24-37c3-161c65a409a4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateRevealIntegral Property

Could not create integral reveal for wall instance. [Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateRevealIntegral { get; }
```